import schedule
import time
import telebot 
from parts import *
bot = telebot.TeleBot("6709370621:AAH8ErEPkh9dzu7V9m4kuL7thNeHdjYeUxs")
from helper import *

db_gr = Database_gr(path_to_db="data/group.db")
db = Database(path_to_db="data/main.db")

def time_calc(timer):
    a = timer

    b = list(a.split(":"))
    c = b[1]
    b[1] = int(b[1]) - 5
    if b[1]>=0:

	    return str(b[0])+":"+str(b[1]).zfill(2)
    else:
	    return str(int(b[0])-1).zfill(2)+":"+str(str(60-abs(b[1])).zfill(2))

def bomdod():
    try:
        users = db_gr.select_all_users()
        for user in users:
            user_id = user[0]
            bot.send_message(chat_id=user_id,text=f"""
Бомдод вақтига оз қолди.
Бомдод вақти: {get_time()[0]} (Тошкент вақти)

Тошкентдан бошқа шаҳарлардаги вақт фарқи⏰

Аввал:⏪
(-1)     -   Чимкент
(-5)     -   Конибодом
(-6)     -   Хўжанд
(-7)     -   Қўқон
(-7)     -   Жамбул
(-10)   -   Наманган
(-10)   -   Фарғона
(-10)   -   Марғилон
(-11)   -   Андижон
(-14)   -   Ўш
(-15)   -   Жалолобод
(-21)   -   Бишкек
(-21)   -   Олма Ота

Кейин:⏩
(+4)     -   Бекобод
(+4)     -   Туркистон
(+6)     -   Жиззах
(+7)     -   Гулистон
(+7)     -   Денов
(+7)     -   Жомбой
(+9)     -   Самарқанд
(+10)   -   Шаҳрисабз
(+12)   -   Каттақўрғон
(+12)   -   Қарши
(+14)   -   Нурота
(+19)   -   Навоий
(+21)   -   Бухоро
(+35)   -   Хива
(+42)   -   Нукус

Батафсил маълумот олиш учун: @PrayingTime_bot
""")
    except:
        pass

def peshin():
    users = db_gr.select_all_users()
    try:
        for user in users:
            user_id = user[0]


        bot.send_message(chat_id=user_id,text=f"""
Пешин вақтига оз қолди
Пешин вақти: {get_time()[1]} (Тошкент вақти)

Тошкентдан бошқа шаҳарлардаги вақт фарқи⏰

Аввал:⏪
(-1)     -   Чимкент
(-5)     -   Конибодом
(-6)     -   Хўжанд
(-7)     -   Қўқон
(-7)     -   Жамбул
(-10)   -   Наманган
(-10)   -   Фарғона
(-10)   -   Марғилон
(-11)   -   Андижон
(-14)   -   Ўш
(-15)   -   Жалолобод
(-21)   -   Бишкек
(-21)   -   Олма Ота

Кейин:⏩
(+4)     -   Бекобод
(+4)     -   Туркистон
(+6)     -   Жиззах
(+7)     -   Гулистон
(+7)     -   Денов
(+7)     -   Жомбой
(+9)     -   Самарқанд
(+10)   -   Шаҳрисабз
(+12)   -   Каттақўрғон
(+12)   -   Қарши
(+14)   -   Нурота
(+19)   -   Навоий
(+21)   -   Бухоро
(+35)   -   Хива
(+42)   -   Нукус

Батафсил маълумот олиш учун: @PrayingTime_bot
""")
    except:
        pass

def asr():
    users = db_gr.select_all_users()
    try:
        for user in users:
            user_id = user[0]


            bot.send_message(chat_id=user_id,text=f"""
Aср вақтида оз қолди.
Aср вақти: {get_time()[2]} (Тошкент вақти)

Тошкентдан бошқа шаҳарлардаги вақт фарқи⏰

Аввал:⏪
(-1)     -   Чимкент
(-5)     -   Конибодом
(-6)     -   Хўжанд
(-7)     -   Қўқон
(-7)     -   Жамбул
(-10)   -   Наманган
(-10)   -   Фарғона
(-10)   -   Марғилон
(-11)   -   Андижон
(-14)   -   Ўш
(-15)   -   Жалолобод
(-21)   -   Бишкек
(-21)   -   Олма Ота

Кейин:⏩
(+4)     -   Бекобод
(+4)     -   Туркистон
(+6)     -   Жиззах
(+7)     -   Гулистон
(+7)     -   Денов
(+7)     -   Жомбой
(+9)     -   Самарқанд
(+10)   -   Шаҳрисабз
(+12)   -   Каттақўрғон
(+12)   -   Қарши
(+14)   -   Нурота
(+19)   -   Навоий
(+21)   -   Бухоро
(+35)   -   Хива
(+42)   -   Нукус

Батафсил маълумот олиш учун: @PrayingTime_bot
""")
    except:
        pass

def shom():
    users = db_gr.select_all_users()
    try:
        
        for user in users:
            user_id = user[0]


        bot.send_message(chat_id=user_id,text=f"""
Шом вақтида оз қолди.
Шом вақти: {get_time()[3]} (Тошкент вақти)

Тошкентдан бошқа шаҳарлардаги вақт фарқи⏰

Аввал:⏪
(-1)     -   Чимкент
(-5)     -   Конибодом
(-6)     -   Хўжанд
(-7)     -   Қўқон
(-7)     -   Жамбул
(-10)   -   Наманган
(-10)   -   Фарғона
(-10)   -   Марғилон
(-11)   -   Андижон
(-14)   -   Ўш
(-15)   -   Жалолобод
(-21)   -   Бишкек
(-21)   -   Олма Ота

Кейин:⏩
(+4)     -   Бекобод
(+4)     -   Туркистон
(+6)     -   Жиззах
(+7)     -   Гулистон
(+7)     -   Денов
(+7)     -   Жомбой
(+9)     -   Самарқанд
(+10)   -   Шаҳрисабз
(+12)   -   Каттақўрғон
(+12)   -   Қарши
(+14)   -   Нурота
(+19)   -   Навоий
(+21)   -   Бухоро
(+35)   -   Хива
(+42)   -   Нукус

Батафсил маълумот олиш учун: @PrayingTime_bot
""")
    except:
        pass
def xufton():
    users = db_gr.select_all_users()
    try:
        for user in users:
            user_id = user[0]


            bot.send_message(chat_id=user_id,text=f"""
Хуфтон вақтида оз қолди.
Хуфтон вақти: {get_time()[4]} (Тошкент вақти)

Тошкентдан бошқа шаҳарлардаги вақт фарқи⏰

Аввал:⏪
(-1)     -   Чимкент
(-5)     -   Конибодом
(-6)     -   Хўжанд
(-7)     -   Қўқон
(-7)     -   Жамбул
(-10)   -   Наманган
(-10)   -   Фарғона
(-10)   -   Марғилон
(-11)   -   Андижон
(-14)   -   Ўш
(-15)   -   Жалолобод
(-21)   -   Бишкек
(-21)   -   Олма Ота

Кейин:⏩
(+4)     -   Бекобод
(+4)     -   Туркистон
(+6)     -   Жиззах
(+7)     -   Гулистон
(+7)     -   Денов
(+7)     -   Жомбой
(+9)     -   Самарқанд
(+10)   -   Шаҳрисабз
(+12)   -   Каттақўрғон
(+12)   -   Қарши
(+14)   -   Нурота
(+19)   -   Навоий
(+21)   -   Бухоро
(+35)   -   Хива
(+42)   -   Нукус

Батафсил маълумот олиш учун: @PrayingTime_bot
""")
    except:
        pass
print("---[]---")
print(time_calc(get_time()[0]))
print(time_calc(get_time()[1]))
print(time_calc(get_time()[2]))
print(time_calc(get_time()[3]))
print(time_calc(get_time()[4]))

schedule.every().day.at(time_calc(get_time()[0])).do(bomdod)
schedule.every().day.at(time_calc(get_time()[1])).do(peshin)
schedule.every().day.at(time_calc(get_time()[2])).do(asr)
schedule.every().day.at(time_calc(get_time()[3])).do(shom)
schedule.every().day.at(time_calc(get_time()[4])).do(xufton)

while True:
    schedule.run_pending()
    time.sleep(1)
